-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Апр 06 2023 г., 21:39
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `db_films`
--

-- --------------------------------------------------------

--
-- Структура таблицы `films`
--

CREATE TABLE `films` (
  `id` int NOT NULL,
  `name` varchar(50) NOT NULL,
  `year` int NOT NULL,
  `description` varchar(600) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `descriptionLong` varchar(1000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `image` varchar(400) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `genre` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `director` varchar(50) NOT NULL,
  `status` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `films`
--

INSERT INTO `films` (`id`, `name`, `year`, `description`, `descriptionLong`, `image`, `genre`, `director`, `status`) VALUES
(1, 'Гаррі Поттер і філософський камінь', 2001, '«Га́ррі По́ттер і філосо́фський ка́мінь» (англ. Harry Potter and the Philosopher\'s Stone) — перший із серії фільмів про хлопчика-чарівника Гаррі Поттера, екранізація однойменного роману британської письменниці Дж. К. Роулінг. ', 'Фільм був знятий режисером Крісом Коламбусом (він працював і над другим фільмом серії). Головні ролі виконали 12-річні Деніел Редкліфф, Руперт Грінт та 11-річна Емма Вотсон. У багатьох дорослих ролях зняті провідні британські актори, такі як Меґґі Сміт, Алан Рікман, Джон Кліз та інші. Фільм був номінований на три премії «Оскар» в технічних номінаціях, але не виграв жодну з них. Його можна дивитися дітям разом з батьками (Рейтинг PG від MPAA).', 'garry1.webp', 'фентезі, пригоди, сімейний', 'Кріс Коламбус', 1),
(2, 'Шимпанзе під прикриттям', 2021, 'У ролі Джеймса Бонда – шимпанзе! Найнезвичайніший супершпигун повинен завадити ексцентричному суперлиходію захопити світ за допомогою новітніх роботів. Безпека людства виявляється в спритних волохатих лапах.', 'Він рішучий, швидкий, а його кмітливості та витривалості позаздрить найславетніший спецагент! Його звуть Сем, і він – шимпанзе. Пухнастий представник мавпячого сімейства працює в суперсекретній службі, яка ловить найнебезпечніших і зухваліших злочинців, готових піти на все, аби досягти своїх підступних цілей.\r\nАле коли на шляху перед ними встає бравий шимпанзе, можна бути впевненим: кожен з головорізів буде покараний!\r\nВільний від роботи час Сем проводить зі своєю колегою та найкращою подругою Бонді, яка обожнює свого напарника.\r\nАле їх команду чекає нова складна місія: група злочинців розробить небезпечну зброю на віддаленому острові. Тільки Сем може проникнути туди і запобігти катастрофі. Але чи готовий сміливий шимпанзе до того, що на нього чекає?', 'shympanse.jpg', 'комедія , фантастика , сімейний', 'Алі Замани', 1),
(3, 'Name', 2003, 'korot', 'opys', 'andfgs.jpg', 'Фентезі', 'rejiser', 0),
(4, 'Аватар 2: Шлях Води', 2022, 'Амбітний режисер Джеймс Кемерон не забув про свій грандіозний проєкт — фантастичний у всіх сенсах «Аватар».', 'Розробка сюжету, зйомки та монтаж тривають вже 12 років. Сюжет 2 частини розкаже нам про головних героїв — Джейка та Нейтирі, які встигли створити свою сім\'ю та старанно виховують дітей. Тепер вже велике сімейство приймає в свою родину ще одну дитину, яка народилася на військовій базі планети Пандора. Хлопчик не зміг вирушити на Землю, оскільки був ще дуже малий. Мати Нейтирі, зрозуміло, бачить в цій дитині нащадка своїх заклятих ворогів, що колись зруйнували її будинок і вбили батька. Передчуття не дурить героїню Зої Салдана: з\'ясовується, що людські загарбники мають намір довести справу до кінця та завоювати Пандору. Це перший із чотирьох запланованих продовжень «Аватара», частина зйомок якого пройшли під водою.', 'avatar2.jpg', 'Фентезі, Пригоди, Фантастика, Драми, Комедія', 'Джеймс Кемерон', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `login` varchar(50) NOT NULL,
  `name` varchar(50) NOT NULL,
  `pass` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `films`
--
ALTER TABLE `films`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `films`
--
ALTER TABLE `films`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
